In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("train.csv")
data2 = pd.read_csv("test.csv")
dataorg = data

In [3]:
dataorg.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
dataorg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
data['family'] = data['SibSp'] + data['Parch']

In [6]:
mean_age = data['Age'].mean()

In [7]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
%config InlineBackend.figure_format = 'svg'

In [8]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Embarked','Cabin'],axis=1,inplace=True)

In [9]:
data.head()

   Survived  Pclass     Sex   Age     Fare  family
0         0       3    male  22.0   7.2500       1
1         1       1  female  38.0  71.2833       1
2         1       3  female  26.0   7.9250       0
3         1       1  female  35.0  53.1000       1
4         0       3    male  35.0   8.0500       0

In [10]:
data['Sex'] = data['Sex'].map({'male':1,'female':0})

In [11]:
data.head()

   Survived  Pclass  Sex   Age     Fare  family
0         0       3    1  22.0   7.2500       1
1         1       1    0  38.0  71.2833       1
2         1       3    0  26.0   7.9250       0
3         1       1    0  35.0  53.1000       1
4         0       3    1  35.0   8.0500       0

In [12]:
data['Age'].fillna(mean_age,inplace=True)

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       891 non-null    float64
 4   Fare      891 non-null    float64
 5   family    891 non-null    int64
dtypes: float64(2), int64(4)
memory usage: 41.9 KB

In [14]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

x,y=data.drop('Survived',axis=1),data['Survived']

In [15]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=42)

In [16]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 623 entries, 445 to 102
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  623 non-null    int64
 1   Sex     623 non-null    int64
 2   Age     623 non-null    float64
 3   Fare    623 non-null    float64
 4   family  623 non-null    int64
dtypes: float64(2), int64(3)
memory usage: 29.2 KB

In [17]:
logreg = LogisticRegression()
logreg.fit(x_train, y_train)
y_pred = logreg.predict(x_test)
accuracy = accuracy_score(y_test, y_pred)
print("Accuracy:", accuracy)

Accuracy: 0.8059701492537313